In [7]:
import pandas as pd

In [8]:
pd.__version__

'2.3.2'

In [26]:
#crete dataframe
df=pd.DataFrame([11,22,33,44,55],columns=['A'])
df

    A
0  11
1  22
2  33
3  44
4  55

#use shift + tab to check all the function information.

In [ ]:
from matplotlib import pyplot as plt
import numpy as np

# Generate 100 random data points along 3 dimensions
x, y, scale = np.random.randn(3, 100)
fig, ax = plt.subplots()

# Map each onto a scatterplot we'll create with Matplotlib
ax.scatter(x=x, y=y, c=scale, s=np.abs(scale)*500)
ax.set(title="Some random data, created with JupyterLab!")
plt.show()

In [16]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [21]:
data={
    'Name':['Syed','Asif','Altaf'],
    'age':[25,26,27],
    'salary':[20000,30000,40000]
}

In [28]:
df=pd.DataFrame(data)
df

    Name  age  salary
0   Syed   25   20000
1   Asif   26   30000
2  Altaf   27   40000

In [31]:
df.head(1) returns top rows

   Name  age  salary
0  Syed   25   20000

In [32]:
df.tail(1) returns bottom rows

    Name  age  salary
2  Altaf   27   40000

In [34]:
df.shape #retruns rowsxcolumns.

(3, 3)

In [35]:
df.columns #will list column name

Index(['Name', 'age', 'salary'], dtype='object')

In [41]:
df.rename(columns={'salary':'monthly salary'},inplace=True) #rename column name and inplace should be true to permanently change column name.
df

    Name  age  monthly salary
0   Syed   25           20000
1   Asif   26           30000
2  Altaf   27           40000

In [44]:
df.info() #provides dataframes information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            3 non-null      object
 1   age             3 non-null      int64
 2   monthly salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 132.0+ bytes

In [46]:
df.describe() #provides highlevel statistical summary

        age  monthly salary
count   3.0             3.0
mean   26.0         30000.0
std     1.0         10000.0
min    25.0         20000.0
25%    25.5         25000.0
50%    26.0         30000.0
75%    26.5         35000.0
max    27.0         40000.0

In [55]:
df.to_csv("pdtestdata.csv",index=False) #export dataframe

In [59]:
pd.read_csv('pdtestdata.csv') #import dataframe

    Name  age  monthly salary
0   Syed   25           20000
1   Asif   26           30000
2  Altaf   27           40000

In [61]:
load_df=pd.read_csv('pdtestdata.csv')
load_df

    Name  age  monthly salary
0   Syed   25           20000
1   Asif   26           30000
2  Altaf   27           40000

In [62]:
df

    Name  age  monthly salary
0   Syed   25           20000
1   Asif   26           30000
2  Altaf   27           40000

In [67]:
#select required columns 
df[['Name','age']]

    Name  age
0   Syed   25
1   Asif   26
2  Altaf   27

In [71]:
df.loc[df.Name=='Syed'] #use df.loc to find row  level data

   Name  age  monthly salary
0  Syed   25           20000

In [76]:
df.loc[(df.Name=='Syed') & (df.age==25)] #perform comparision using df.loc

   Name  age  monthly salary
0  Syed   25           20000

In [78]:
df.iloc[0] #index based search on data

Name               Syed
age                  25
monthly salary    20000
Name: 0, dtype: object

In [79]:
df.iloc[0:2]

   Name  age  monthly salary
0  Syed   25           20000
1  Asif   26           30000

In [80]:
df #filter dataframe

    Name  age  monthly salary
0   Syed   25           20000
1   Asif   26           30000
2  Altaf   27           40000

In [85]:
df['age']>25

0    False
1     True
2     True
Name: age, dtype: bool

In [86]:
df[df['age']>25]

    Name  age  monthly salary
1   Asif   26           30000
2  Altaf   27           40000

In [88]:
df_age_filter=df[df['age']>25]
df_age_filter

    Name  age  monthly salary
1   Asif   26           30000
2  Altaf   27           40000

In [91]:
df[(df['age']>25) & (df['monthly salary']>30000)]

    Name  age  monthly salary
2  Altaf   27           40000

In [92]:
df.where(df['age']>25)

    Name   age  monthly salary
0    NaN   NaN             NaN
1   Asif  26.0         30000.0
2  Altaf  27.0         40000.0

In [93]:
df.where(df['age']>25,other='not eligible')

           Name           age monthly salary
0  not eligible  not eligible   not eligible
1          Asif            26          30000
2         Altaf            27          40000

In [94]:
df #rows and column operations

    Name  age  monthly salary
0   Syed   25           20000
1   Asif   26           30000
2  Altaf   27           40000

In [97]:
#add new column
df['Team']=['HR','CEO','DE']
df

    Name  age  monthly salary Team
0   Syed   25           20000   HR
1   Asif   26           30000  CEO
2  Altaf   27           40000   DE

In [100]:
df['Bonus']= df['monthly salary'] * 0.10
df

    Name  age  monthly salary Team   Bonus
0   Syed   25           20000   HR  2000.0
1   Asif   26           30000  CEO  3000.0
2  Altaf   27           40000   DE  4000.0

In [101]:
len(df) #returns length of dataframe

3

In [107]:
df.loc[len(df)]=['imran',24,10000,'analyst',1000]
df

    Name  age  monthly salary     Team   Bonus
0   Syed   25           20000       HR  2000.0
1   Asif   26           30000      CEO  3000.0
2  Altaf   27           40000       DE  4000.0
3  imran   24           10000  analyst  1000.0
4  imran   24           10000  analyst  1000.0
5  imran   24           10000  analyst  1000.0

In [104]:
!pip install pandas

<class 'OSError'>: Not available

## Next steps üèÉ

This is just a short introduction to JupyterLab and Jupyter Notebooks. See below for some more ways to interact with tools in the Jupyter ecosystem, and its community.

### Other notebooks in this demo

Here are some other notebooks in this demo. Each of the items below corresponds to a file or folder in the **file browser to the left**.

- [**`Lorenz.ipynb`**](Lorenz.ipynb) uses Python to demonstrate interactive visualizations and computations around the [Lorenz system](https://en.wikipedia.org/wiki/Lorenz_system). It shows off basic Python functionality, including more visualizations, data structures, and scientific computing libraries.
- [**`r.ipynb`**](r.ipynb) demonstrates the R programming language for statistical computing and data analysis.
- [**`cpp.ipynb`**](cpp.ipynb) demonstrates the C++ programming language for scientific computing and data analysis.
- [**`sqlite.ipynb`**](sqlite.ipynb) demonstrates how an in-browser sqlite kernel to run your own SQL commands from the notebook. It uses the [jupyterlite/xeus-sqlite-kernel](https://github.com/jupyterlite/xeus-sqlite-kernel).

### Other sources of information in Jupyter

- **More on using JupyterLab**: See [the JupyterLab documentation](https://jupyterlab.readthedocs.io/en/stable/) for more thorough information about how to install and use JupyterLab.
- **More interactive demos**: See [try.jupyter.org](https://try.jupyter.org) for more interactive demos with the Jupyter ecosystem.
- **Learn more about Jupyter**: See [the Jupyter community documentation](https://docs.jupyter.org) to learn more about the project, its community and tools, and how to get involved.
- **Join our discussions**: The [Jupyter Community Forum](https://discourse.jupyter.org) is a place where many in the Jupyter community ask questions, help one another, and discuss issues around interactive computing and our ecosystem.

In [110]:
#update values
df.loc[4,'Name']='galib'
df

    Name  age  monthly salary     Team   Bonus
0   Syed   25           20000       HR  2000.0
1   Asif   26           30000      CEO  3000.0
2  Altaf   27           40000       DE  4000.0
3  imran   24           10000  analyst  1000.0
4  galib   24           10000  analyst  1000.0
5  imran   24           10000  analyst  1000.0

In [112]:
df.loc[5,'Name']='sharuk'
df

     Name  age  monthly salary     Team   Bonus
0    Syed   25           20000       HR  2000.0
1    Asif   26           30000      CEO  3000.0
2   Altaf   27           40000       DE  4000.0
3   imran   24           10000  analyst  1000.0
4   galib   24           10000  analyst  1000.0
5  sharuk   24           10000  analyst  1000.0

In [123]:
#delete values
df.drop(df[df.Name=='galib'].index)

     Name  age  monthly salary     Team   Bonus
0    Syed   25           20000       HR  2000.0
1    Asif   26           30000      CEO  3000.0
2   Altaf   27           40000       DE  4000.0
3   imran   24           10000  analyst  1000.0
5  sharuk   24           10000  analyst  1000.0

In [124]:
df.drop('Bonus',axis=1)

     Name  age  monthly salary     Team
0    Syed   25           20000       HR
1    Asif   26           30000      CEO
2   Altaf   27           40000       DE
3   imran   24           10000  analyst
4   galib   24           10000  analyst
5  sharuk   24           10000  analyst

In [127]:
df.drop(df[df.Name=='imran'].index) #drop rows

     Name  age  monthly salary     Team   Bonus
0    Syed   25           20000       HR  2000.0
1    Asif   26           30000      CEO  3000.0
2   Altaf   27           40000       DE  4000.0
4   galib   24           10000  analyst  1000.0
5  sharuk   24           10000  analyst  1000.0

In [128]:
df.drop('Bonus',axis=1,inplace=True) #drop columns

In [129]:
df

     Name  age  monthly salary     Team
0    Syed   25           20000       HR
1    Asif   26           30000      CEO
2   Altaf   27           40000       DE
3   imran   24           10000  analyst
4   galib   24           10000  analyst
5  sharuk   24           10000  analyst

In [130]:
df.loc[4,'Team']='instructor'

In [67]:
df

    name  age  salary team        doj  month
0   syed   25   20000   hr 2026-01-01      1
1   asif   26   30000   de 2026-02-02      2
2  altaf   27   40000  sde 2026-03-03      3
3  galib   24   10000  NaN 2026-04-04      4

In [134]:
df.loc[5,'Team']='field operator'

In [137]:
df

     Name  age  monthly salary            Team
0    Syed   25           20000              HR
1    Asif   26           30000             CEO
2   Altaf   27           40000              DE
3   imran   24           10000         analyst
4   galib   24           10000      instructor
5  sharuk   24           10000  field operator

In [149]:
df.drop(df[df.Name=='imran'].index,inplace=True)

In [150]:
df

     Name  age  monthly salary            Team
0    Syed   25           20000              HR
1    Asif   26           30000             CEO
2   Altaf   27           40000              DE
4   galib   24           10000      instructor
5  sharuk   24           10000  field operator

In [151]:
df.drop(5,inplace=True)

In [152]:
df

    Name  age  monthly salary        Team
0   Syed   25           20000          HR
1   Asif   26           30000         CEO
2  Altaf   27           40000          DE
4  galib   24           10000  instructor

In [156]:
df.rename(columns={'monthly salary':'salary'},inplace=True)

In [157]:
df

    Name  age  salary        Team
0   Syed   25   20000          HR
1   Asif   26   30000         CEO
2  Altaf   27   40000          DE
4  galib   24   10000  instructor

In [158]:
df.sort_values('age')

    Name  age  salary        Team
4  galib   24   10000  instructor
0   Syed   25   20000          HR
1   Asif   26   30000         CEO
2  Altaf   27   40000          DE

In [68]:
df.loc[4,'age']=28
df

    name   age   salary team        doj  month
0   syed  25.0  20000.0   hr 2026-01-01    1.0
1   asif  26.0  30000.0   de 2026-02-02    2.0
2  altaf  27.0  40000.0  sde 2026-03-03    3.0
3  galib  24.0  10000.0  NaN 2026-04-04    4.0
4    NaN  28.0      NaN  NaN        NaT    NaN

In [16]:
import pandas as pd
df=pd.DataFrame(['syed','asif','altaf','galib'], columns=['name'])
df

    name
0   syed
1   asif
2  altaf
3  galib

In [17]:
df['age']=[25,26,27,24]

In [18]:
df

    name  age
0   syed   25
1   asif   26
2  altaf   27
3  galib   24

In [19]:
df['salary']=[20000,30000,40000,10000]

In [20]:
df

    name  age  salary
0   syed   25   20000
1   asif   26   30000
2  altaf   27   40000
3  galib   24   10000

In [21]:
df['team']=['hr','de','sde','instructor']

In [22]:
df

    name  age  salary        team
0   syed   25   20000          hr
1   asif   26   30000          de
2  altaf   27   40000         sde
3  galib   24   10000  instructor

In [23]:
df['doj']=['2026-01-01','2026-02-02','2026-03-03','2026-04-04']

In [24]:
df

    name  age  salary        team         doj
0   syed   25   20000          hr  2026-01-01
1   asif   26   30000          de  2026-02-02
2  altaf   27   40000         sde  2026-03-03
3  galib   24   10000  instructor  2026-04-04

In [25]:
df['doj'].dtype

dtype('O')

In [26]:
 df['doj']=pd.to_datetime(df['doj']) #convert obj type into date

In [27]:
df

    name  age  salary        team        doj
0   syed   25   20000          hr 2026-01-01
1   asif   26   30000          de 2026-02-02
2  altaf   27   40000         sde 2026-03-03
3  galib   24   10000  instructor 2026-04-04

In [28]:
df['doj'].dtype

dtype('<M8[ns]')

In [63]:
df['month']=df['doj'].dt.month
df

    name  age  salary team        doj  month
0   syed   25   20000   hr 2026-01-01      1
1   asif   26   30000   de 2026-02-02      2
2  altaf   27   40000  sde 2026-03-03      3
3  galib   24   10000  NaN 2026-04-04      4

In [34]:
df['doj'].dt.year #date functions
df['doj'].dt.month
df['doj'].dt.day
df['doj'].dt.day_name()

0    Thursday
1      Monday
2     Tuesday
3    Saturday
Name: doj, dtype: object

In [36]:
df['doj']-pd.Timedelta(days=30)  #difference btw dates (+,-)

0   2025-12-02
1   2026-01-03
2   2026-02-01
3   2026-03-05
Name: doj, dtype: datetime64[ns]

In [37]:
#handling missing values

In [38]:
df.isnull() #returns true if value is null.

    name    age  salary   team    doj
0  False  False   False  False  False
1  False  False   False  False  False
2  False  False   False  False  False
3  False  False   False  False  False

In [39]:
df

    name  age  salary        team        doj
0   syed   25   20000          hr 2026-01-01
1   asif   26   30000          de 2026-02-02
2  altaf   27   40000         sde 2026-03-03
3  galib   24   10000  instructor 2026-04-04

In [45]:
import numpy as np
df.loc[df.name=='galib','team']=np.nan
df

    name  age  salary team        doj
0   syed   25   20000   hr 2026-01-01
1   asif   26   30000   de 2026-02-02
2  altaf   27   40000  sde 2026-03-03
3  galib   24   10000  NaN 2026-04-04

In [46]:
df.isnull()

    name    age  salary   team    doj
0  False  False   False  False  False
1  False  False   False  False  False
2  False  False   False  False  False
3  False  False   False   True  False

In [47]:
df.isnull().sum() #to check null values in large dataframes

name      0
age       0
salary    0
team      1
doj       0
dtype: int64

In [48]:
df.fillna('bench')

    name  age  salary   team        doj
0   syed   25   20000     hr 2026-01-01
1   asif   26   30000     de 2026-02-02
2  altaf   27   40000    sde 2026-03-03
3  galib   24   10000  bench 2026-04-04

In [60]:
df['team'].value_counts()

team
hr     1
de     1
sde    1
Name: count, dtype: int64

In [55]:
df['doj'].dt.day_name.value_counts()

doj
Thursday    1
Monday      1
Tuesday     1
Saturday    1
Name: count, dtype: int64

In [66]:
df.groupby('month')['salary'].mean()

month
1    20000.0
2    30000.0
3    40000.0
4    10000.0
Name: salary, dtype: float64